// Сервис для хранения пользовательских реквизитов карточек
// 1. Придумать формат БД(помнить про нормализацию)
// 2. Сделать апи удаление/создание/обновление реквизитов и пользователей
// 3. Сделать асинхронный слушатель, который будет отслеживать реквизиты, и когда они просрочатся удалять их асинхронно

// Каждый пользователь может иметь неограниченное количество платежных карт
// Таблица пользователей
// Таблица платежных карт
// Таблица банков эмитентов платежных карт

// api
// Добавление/Обновление/Удаление/Чтение пользователя
// Добавление/Обновление/Удаление/Чтение банка
// Добавление/Обновление/Удаление/Чтение платежной карты
// Асинхронное удаление просроченных платежных карт

package main

import (
	bootstrap "bank-microservice/cmd"
)

func main() {
	// init all
	bootstrapper, err := bootstrap.New()
	if err != nil {
		return
	}

	// запуск сервера
	bootstrapper.RunAPI()
}
